Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings.GetTransparency
Gets the transparency value of the handle and the associated DirectContext3D graphics.
Returns:
The transparency value (in percentage)
Since:
2018

Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings.SetTransparency(System.Int32)
Sets the transparency value of the handle and the associated DirectContext3D graphics.
transparency:
The transparency value to apply (in percentage)
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The value is invalid. The valid range is 0 through 100
Since:
2018

Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings.IsEqual(Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings)
Check if the contents of two instances of settings are equal.
other:
The settings to be compared.
Returns:
True for equal, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings.Assign(Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings)
Assigns values of the source settings to this object.
other:
The source settings.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings.Visibility
Visibility of the handle and the associated DirectContext3D graphics.
A value of true means that the graphics are visible.
Since:
2018

Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings.#ctor(Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings)
Constructs a copy of source object.
other:
Source object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings.#ctor(System.Boolean,System.Int32)
Constructs an instance of settings with provided values.
visibility:
Source visibility.
transparency:
Source transparency.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The value is invalid. The valid range is 0 through 100
Since:
2018

Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings.#ctor
Constructs an instance of settings with default values.
Since:
2018

Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings
Overriding settings applied to DirectContext3DHandles through the Visibility dialog.
Remarks:
DirectContext3D graphics can be displayed with or without an associated DirectContext3D handle
element. For DirectContext3D graphics that utilize the handle element, the visibility and appearance of
the graphics can be adjusted through the Visibility/Graphics dialog.
Since:
2018